---
kind: property
id: P:Autodesk.Revit.DB.Visual.Gradient.GradientNoiseHigh
source: html/fdef8270-0f35-9bd3-1c7c-22bfeafca94e.htm
---
# Autodesk.Revit.DB.Visual.Gradient.GradientNoiseHigh Property

The property labeled "High" from the "Gradient" schema.

## Syntax (C#)
```csharp
public static string GradientNoiseHigh { get; }
```

## Remarks
This property is of type "AssetPropertyDouble" within the range of "0, 1".